{
  "avatar": {
    "url": "/images/avatar.jpg",
    "alt": {
      "vi": "Ảnh đại diện của Phạm Nguyễn Hoàng Long",
      "en": "Profile picture of Pham Nguyen Hoang Long"
    }
  },
  "name": {
    "vi": "Phạm Nguyễn Hoàng Long",
    "en": "Pham Nguyen Hoang Long"
  },
  "role": {
    "vi": "Kỹ sư phần mềm",
    "en": "Software Engineer"
  },
  "summary": {
    "vi": "Là một Kỹ sư phần mềm Fullstack, tôi đam mê việc dùng công nghệ để giải quyết các bài toán thực tế của doanh nghiệp. Với nền tảng vững chắc về hệ sinh thái .NET và frontend (Next.js/React), tôi chuyên thiết kế các hệ thống RESTful API hiệu năng cao, chú trọng vào sự bền vững thông qua Clean Architecture và Clean Code. Kinh nghiệm thực tế của tôi nằm ở khả năng kết nối các mảnh ghép phức tạp: từ việc tối ưu hóa quy trình ERP, đến tích hợp sâu rộng với các nền tảng lớn như SAP hay Microsoft 365. Mục tiêu của tôi không chỉ là viết code chạy tốt, mà là xây dựng những giải pháp tối ưu và dễ dàng bảo trì về dài hạn.",
    "en": "Result-oriented Software Engineer with hands-on experience in developing enterprise-grade applications. Specialized in Fullstack Development with the .NET ecosystem and modern frontend frameworks (Next.js, React). Strong focus on building scalable RESTful APIs using Clean Architecture, Entity Framework Core, and Dependency Injection. Proven track record in optimizing internal ERP workflows and integrating complex systems (SAP, Microsoft Graph). Passionate about writing clean, maintainable code and solving business problems through technology. Experienced in delivering fullstack solutions within enterprise environments, bridging backend systems, frontend applications, and large-scale platforms such as SAP and Microsoft 365."
  },
  "university": {
    "name": {
      "vi": "Học Viện Hàng Không Việt Nam",
      "en": "Viet Nam Aviation Academy"
    },
    "department": {
      "vi": "Công nghệ Thông tin",
      "en": "Information Technology"
    }
  },
  "experience": [
    {
      "company": {
        "vi": "I Group Corporation",
        "en": "I Group Corporation"
      },
      "position": {
        "vi": "Kỹ sư phần mềm",
        "en": "Software Engineer"
      },
      "period": {
        "vi": "03/2025 - Hiện tại",
        "en": "03/2025 - Present"
      },
      "description": {
        "vi": "Thiết kế và phát triển các tính năng fullstack end-to-end cho hệ sinh thái ERP cốt lõi, bao gồm backend (.NET Core) và frontend (Next.js / Flutter), tuân theo nguyên tắc Clean Architecture. Triển khai Dependency Injection trong toàn bộ hệ thống, tối ưu hóa lớp truy cập dữ liệu với Entity Framework Core và LINQ, xây dựng thư viện UI components tái sử dụng cho Web và Mobile. Tích hợp mạnh mẽ giữa ERP nội bộ với SAP S/4HANA và Microsoft 365. Áp dụng các thực hành quản lý dịch vụ theo ITIL v4, phát triển các tính năng có tác động cao như hệ thống Digital ID và Competency Assessment, cải thiện hiệu quả xác minh HR lên 60%.",
        "en": "Designed and developed end-to-end fullstack features for the Enterprise Resource Planning (ERP) Core Ecosystem, including backend services (.NET Core) and frontend interfaces (Next.js / Flutter), following Clean Architecture principles. Implemented Dependency Injection (DI) throughout the system, optimized data access layers using Entity Framework Core and LINQ, built reusable UI component libraries for Web and Mobile platforms. Engineered robust integrations between internal ERP and SAP S/4HANA and Microsoft 365. Applied ITIL v4-aligned service management practices, delivered high-impact features including Digital ID system and Competency Assessment, improving HR verification efficiency by 60%."
      },
      "projects": [
        {
          "name": {
            "vi": "ERP Core Ecosystem",
            "en": "ERP Core Ecosystem"
          },
          "role": {
            "vi": "Fullstack Developer",
            "en": "Fullstack Developer"
          },
          "tech": ".NET Core (Clean Architecture, EF Core, DI), Next.js, Flutter, SQL Server, Docker, Microsoft Graph API, SAP S/4HANA, Moodle",
          "achievements": {
            "vi": "• Thiết kế và phát triển các tính năng fullstack end-to-end, bao gồm backend services (.NET Core) và frontend interfaces (Next.js / Flutter), tuân theo nguyên tắc Clean Architecture.\n• Triển khai Dependency Injection (DI) trong toàn bộ hệ thống để tách biệt các thành phần, giúp tăng tốc độ phát triển tính năng lên 30% và hỗ trợ các mẫu Unit Testing hiệu quả.\n• Tối ưu hóa lớp truy cập dữ liệu sử dụng Entity Framework Core và LINQ, xử lý các truy vấn phức tạp cho các module HR và Operational trong khi đảm bảo hiệu suất cao.\n• Xây dựng thư viện UI components tái sử dụng cho hệ thống ERP để đảm bảo tính nhất quán trong thiết kế trên các nền tảng Web (Next.js) và Mobile (Flutter).\n• Thiết kế tích hợp mạnh mẽ giữa ERP nội bộ với SAP S/4HANA (đồng bộ dữ liệu master, quy trình hoạt động) và Microsoft 365 (Graph API), cho phép tự động hóa các quy trình liên phòng ban.\n• Áp dụng các thực hành quản lý dịch vụ theo ITIL v4 khi phát triển và vận hành hệ thống ERP, đảm bảo xử lý có cấu trúc cho các sự cố, yêu cầu thay đổi và cải tiến dịch vụ liên tục.\n• Phát triển các tính năng có tác động cao bao gồm hệ thống Digital ID (Flutter) và Competency Assessment (Moodle), cải thiện hiệu quả xác minh HR lên 60%.",
            "en": "• Designed and developed end-to-end fullstack features, including backend services (.NET Core) and frontend interfaces (Next.js / Flutter), following Clean Architecture principles.\n• Implemented Dependency Injection (DI) throughout the system to decouple components, facilitating 30% faster feature development and enabling effective Unit Testing patterns.\n• Optimized data access layers using Entity Framework Core and LINQ, handling complex queries for HR and Operational modules while ensuring high performance.\n• Built reusable UI component libraries for the ERP system to ensure design consistency across Web (Next.js) and Mobile (Flutter) platforms.\n• Engineered robust integrations between the internal ERP and SAP S/4HANA (master data synchronization, operational workflows) and Microsoft 365 (Graph API), enabling automated cross-department processes.\n• Applied ITIL v4-aligned service management practices when developing and operating ERP systems, ensuring structured handling of incidents, change requests, and continuous service improvements.\n• Delivered high-impact features including the Digital ID system (Flutter) and Competency Assessment (Moodle), improving HR verification efficiency by 60%."
          }
        },
        {
          "name": {
            "vi": "Business & Analytics",
            "en": "Business & Analytics"
          },
          "role": {
            "vi": "Business Analyst / Data Analyst",
            "en": "Business Analyst / Data Analyst"
          },
          "tech": "SQL Server, Power BI, Microsoft Project",
          "achievements": {
            "vi": "• Hợp tác với các bên liên quan để phân tích yêu cầu kinh doanh và chuyển đổi chúng thành quy trình hệ thống cho các quy trình E-Procurement (PR, PO, phê duyệt).\n• Phát triển các dashboard Power BI để giám sát hiệu suất mua sắm, đánh giá nhà cung cấp và các chỉ số tối ưu hóa chi phí.\n• Hỗ trợ điều phối dự án giữa các nhóm nội bộ và nhà cung cấp bên ngoài để đảm bảo giao hàng đúng hạn.",
            "en": "• Collaborated with stakeholders to analyze business requirements and translate them into system workflows for E-Procurement processes (PR, PO, approvals).\n• Developed Power BI dashboards to monitor procurement performance, supplier evaluation, and cost optimization metrics.\n• Supported project coordination between internal teams and external vendors to ensure on-time delivery."
          }
        }
      ]
    },
    {
      "company": {
        "vi": "MindX Technology School",
        "en": "MindX Technology School"
      },
      "position": {
        "vi": "Giáo viên Công nghệ",
        "en": "Technology Instructor"
      },
      "period": {
        "vi": "09/2025 - Hiện tại",
        "en": "09/2025 - Present"
      },
      "description": {
        "vi": "Giảng dạy các khóa học về lập trình và công nghệ cho học viên. Thiết kế giáo án và tài liệu học tập, hướng dẫn học viên thực hiện các dự án thực tế, và đánh giá sự tiến bộ của học viên.",
        "en": "Teaching programming and technology courses to students. Designing lesson plans and learning materials, guiding students through practical projects, and evaluating student progress."
      }
    },
    {
      "company": {
        "vi": "AU-AVAGO",
        "en": "AU-AVAGO"
      },
      "position": {
        "vi": "Python Developer",
        "en": "Python Developer"
      },
      "period": {
        "vi": "10/2024 - 12/2024",
        "en": "10/2024 - 12/2024"
      },
      "description": {
        "vi": "Phát triển các script Python để tự động hóa các tác vụ lặp lại như nhập dữ liệu, tạo báo cáo, gửi email và quản lý tệp. Xây dựng API hoặc bot để tích hợp với CRM, ERP, Google Sheets, Slack và các nền tảng kinh doanh khác. Phát triển công cụ xử lý dữ liệu, trực quan hóa và phân tích để trích xuất thông tin có ý nghĩa, dự báo xu hướng kinh doanh và tối ưu hóa quy trình hoạt động. Thiết kế và xây dựng các module mở rộng tùy chỉnh theo yêu cầu của khách hàng.",
        "en": "Develop Python scripts to automate repetitive tasks such as data entry, report generation, email dispatching, and file management. Build APIs or bots to integrate with CRM, ERP, Google Sheets, Slack, and other business platforms. Develop tools for data processing, visualization, and analytics to extract meaningful insights, forecast business trends, and optimize operational workflows. Design and build custom extension modules as per customer requirements."
      },
      "tech": "Odoo, OWL, Bootstrap, Python, Pandas, TensorFlow"
    },
    {
      "company": {
        "vi": "Học viện Công nghệ sáng tạo Teky",
        "en": "Teky Academy"
      },
      "position": {
        "vi": "Giáo viên Công nghệ ",
        "en": "Technology Instructor"
      },
      "period": {
        "vi": "10/2023 - 08/2025",
        "en": "10/2023 - 08/2025"
      },
      "description": {
        "vi": "Giảng dạy các khóa học về lập trình, robotics và công nghệ cho học sinh. Hướng dẫn học sinh thực hiện các dự án thực tế và phát triển kỹ năng giải quyết vấn đề.",
        "en": "Teaching programming, robotics, and technology courses to students. Guiding students through practical projects and developing problem-solving skills."
      }
    }
  ],
  "skills": {
    "technical": [
      {
        "category": {
          "vi": "Front-end",
          "en": "Front-end"
        },
        "items": [
          "React",
          "Next.js",
          "TypeScript",
          "JavaScript",
          "Vue.js",
          "Angular",
          "Tailwind CSS",
          "HTML/CSS",
          "Bootstrap",
          "Material UI",
          "JQuery"
        ]
      },
      {
        "category": {
          "vi": "Back-end",
          "en": "Back-end"
        },
        "items": [
          "Node.js",
          "Express",
          "PHP",
          "Laravel",
          "ASP.NET Core",
          "REST API",
          "GraphQL",
          "Python",
          "Flask"
        ]
      },
      {
        "category": {
          "vi": "Cơ sở dữ liệu",
          "en": "Databases"
        },
        "items": ["MongoDB", "PostgreSQL", "SQL Server", "MySQL", "Redis"]
      },
      {
        "category": {
          "vi": "DevOps & Cloud",
          "en": "DevOps & Cloud"
        },
        "items": ["Azure", "AWS", "Docker", "CI/CD", "Git"]
      },
      {
        "category": {
          "vi": "Khác",
          "en": "Others"
        },
        "items": [
          "WordPress",
          "Moodle",
          "Flutter",
          "Microservices",
          "Pandas",
          "TensorFlow",
          "Odoo",
          "Adobe Photoshop",
          "Adobe Illustrator",
          "Figma",
          "SonarQube Testing"
        ]
      }
    ],
    "languages": [
      {
        "name": {
          "vi": "Tiếng Việt",
          "en": "Vietnamese"
        },
        "level": {
          "vi": "Bản ngữ",
          "en": "Native"
        }
      },
      {
        "name": {
          "vi": "Tiếng Anh",
          "en": "English"
        },
        "level": {
          "vi": "Trung cấp",
          "en": "Intermediate"
        }
      }
    ]
  },
  "certificates": [
    {
      "vi": "Microsoft Certified: Azure Fundamentals – AZ-900",
      "en": "Microsoft Certified: Azure Fundamentals – AZ-900"
    },
    {
      "vi": "Microsoft Certified: Power BI Data Analyst Associate - PL-300",
      "en": "Microsoft Certified: Power BI Data Analyst Associate - PL-300"
    },
    {
      "vi": "Google Certificate of Completion – Elements of AI",
      "en": "Google Certificate of Completion – Elements of AIs"
    },
    {
      "vi": "Certified Cybersecurity Educator Professional (CCEP)",
      "en": "Certified Cybersecurity Educator Professional (CCEP)"
    }
  ],
  "research": [
    {
      "title": {
        "vi": "Website học tập các môn lập trình cho khoa Công nghệ thông tin",
        "en": "E-learning website for programming subjects in the Faculty of Information Technology"
      },
      "venue": {
        "vi": "Khoa Công nghệ thông tin, Học viện Hàng không Việt Nam",
        "en": "Faculty of Information Technology"
      },
      "year": 2024,
      "link": ""
    }
  ],
  "contacts": {
    "github": "https://github.com/but14",
    "linkedin": "https://www.linkedin.com/in/long-pham-it/",
    "email": "longpnh14@gmail.com"
  }
}
